// 비속어 목록 배열
const badWords = [
    "fuck", "shit", "18nom", "18num", "18ㅅㅐㄲㅣ", "18ㅅㅐ끼", "18ㅅㅔㅋㅣ", "18ㅅㅔ키", "18년", "18놈", "18새끼", "18세ㅋㅣ", "18세키",
    "boji", "bozi", "dogbaby", "d쥐고", "d지고", "jaji", "jazi", "jot같", "me췬", "me친", "me틴", "mi친", "mi틴", "sex하자", "sex해",
    "yadong", "ya동", "zaji", "zazi", "ㅁㅊ", "ㅁㅣ췬", "ㅁ친", "ㅂㄹ", "ㅂㅁㄱ", "ㅂㅊ", "ㅂ크", "ㅄ", "ㅅ.ㅂ", "ㅅㄲ네", "ㅅㄲ들",
    "ㅅㅂ", "ㅅㅍ", "ㅅㅋ", "ㅅㅐㄲㅣ", "ㅅㅡ루", "ㅅ루", "ㅅ발", "ㅆㄹㄱ", "ㅆㄺ", "ㅆㅂ", "ㅆㅣ", "ㅆㅣ8", "ㅆㅣㅂㅏ", "ㅆㅣ댕",
    "ㅆㅣ뎅", "ㅆㅣ바", "ㅆㅣ발", "ㅆㅣ팍넘", "ㅇㅍㅊㅌ", "ㅇㅒ쁜", "ㅈ.ㄴ", "ㅈㄴ", "ㅈㄹ", "ㅈㅏ위", "ㅈ리", "ㅉ질한", "ㅌㅓㄹㅐㄱㅣ",
    "凸", "ㄱㅅㄲ", "가슴만져", "가슴빨아", "가슴빨어", "가슴조물락", "가슴주물럭", "가슴쪼물딱", "가슴쪼물락", "가슴핧아", "가슴핧어",
    "강간", "강간한다", "같은새끼", "개.웃", "개가튼", "개가튼년", "개가튼뇬", "개간", "개같", "개같은년", "개같이", "개거얼래", "개거얼레",
    "개걸래", "개걸레", "개고치", "개너미", "개넷", "개년", "개념빠가", "개놈", "개독", "개라슥", "개련", "개마이", "개보지", "개보지년",
    "개부달", "개부랄", "개불랄", "개붕알", "개새기", "개새끼", "개색뀌", "개색휘", "개샛기", "개섹", "개셈", "개소리", "개쉐뀌", "개쓰래기",
    "개쓰레기", "개씁년", "개씁블", "개씁자지", "개씨발", "개씨발넘", "개씨발자슥", "개씨블", "개아기", "개애거얼래", "개애걸래", "개에가튼",
    "개에거얼래", "개에걸래", "개자식", "개자지", "개작두넘", "개작두년", "개잡년", "개잡지랄", "개저가튼", "개저씨", "개저엇", "개젓",
    "개젓가튼넘", "개좆", "개지랄", "개지랄넘", "개지랄놈", "개쩌", "개후라", "개후라년", "개후라들놈", "개후라새끼", "걔잡년", "걔잡지랄",
    "거시기", "거지같은", "걸래년", "걸레같은년", "걸레년", "걸레보지", "걸레핀년", "게가튼", "게부럴", "게에가튼", "게저엇", "게젓",
    "게지랄놈", "계새끼", "골빈", "공알", "괘새끼", "괴가튼", "괴에가튼?", "구씹", "굿보지", "귀두", "그나물에", "김대중", "김치녀",
    "꼭지", "깨쌔끼", "나빼썅", "나쁜새끼", "난자마셔", "난자먹어", "난자핧아", "내꺼빨아", "내꺼핧아", "내미랄", "내미럴", "내버지",
    "내씨발", "내자지", "내잠지", "내조지", "너거애비", "년놈", "노네들", "노무노무", "노알라", "노무현", "뇌텅", "뇨온", "뇬",
    "누나강간", "느그매", "늬믜", "늬미", "니기미", "니년", "니믜", "니미", "니미기", "니미랄", "니미럴", "니씨브랄", "니아범",
    "니아범?", "니애미", "니애비", "니할애비", "닝기리", "닥쳐", "닥쳐라", "닥치세", "달달이", "달딸이", "닳은년", "대가리", "대갈",
    "대애가리", "대에가리", "대음순", "더어엉신", "더엉신", "더러운년", "덜은새끼", "돈년", "돈새끼", "돌았네", "돌으년", "돌은새끼",
    "동생강간", "뒈져", "뒤이치기", "뒤져라", "뒤져버", "뒤져야", "뒤져야지", "뒤져요", "뒤졌", "뒤지겠", "뒤지고싶", "뒤지길", "뒤진다",
    "뒤질", "뒤치기", "뒷잇치기", "뒷치기", "드으응신", "드응신", "등신", "디져라", "디졌", "디지고", "디질", "따먹기", "따먹는다",
    "따먹어", "따먹어야지", "따먹었어", "따먹었지", "따먹을까", "따먹자", "따아알따리", "따아알따아리", "따알따리", "딴년", "딸달이",
    "딸딸이", "떠라이", "떠어라아이", "떠어라이", "또라이", "또라인", "또오라아이", "또오라이", "똘아이", "띠바", "띠발", "띠발뇬",
    "띠벌", "띠벨", "띠부우울", "띠부울", "띠불", "띠브울", "띠블", "띠블넘", "띠이바알", "띠이발", "띠이버얼", "띠이벌", "띠이이발",
    "띠이이벌", "런년", "럼들", "롬들", "막간년", "막대쑤셔줘?", "막대핧아줘", "맘충", "맛간년", "맛없는년", "맛이간년", "머갈", "믜칀",
    "믜친", "미띤", "미시친발", "미쳣네", "미쳤나", "미쳤니", "미췬", "미칀", "미치인", "미친", "미친ㅋ", "미친개", "미친구녕",
    "미친구멍", "미친넘", "미친년", "미친놈", "미친눔", "미친새", "미친새끼", "미친색", "미친쉐이", "미친씨부랄", "미티넘", "미틴",
    "미틴넘", "미틴새", "미틴새끼", "미친양반", "미쳐", "바", "바보년", "바리새끼", "바알", "바위년", "반년", "백불이", "벙치기",
    "벙총", "벙탕", "벙청", "벙침", "벙티", "벙탐", "벙총", "벙타", "벙처", "벙탐", "벙철", "벙쿠", "벙춤", "벙팔", "벙딸",
    "병신","븅신","개저씨","한남","한녀","메갈","매갈","여시","쿵쾅","일베","tq","tlqkf","qudtls","qt"
];

// badWords 배열을 외부로 내보내기
export { badWords };
